#+TITLE: March 8-19, 2019 (12 days)
#+AUTHOR: dgplug.org
#+EMAIL: users@lists.dgplug.org
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph
#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:17]"
#+BEGIN: block-update-burndown
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 12
  :SPRINTSTART: <2019-03-08 Fri>
  :wpd-nightwarrior-xxx: 2.5
  :END:
** nightwarrior-xxx
*** Learn React [0/10]
    :PROPERTIES:
    :ESTIMATED: 6
    :ACTUAL:
    :OWNER: nightwarrior-xxx
    :ID: DEV.1552139317
    :TASKID: DEV.1552139317
    :END:
    - [ ] Understanding the Base Features & Syntax
    - [ ] Working with Lists and Conditionals
    - [ ] Styling React Components & Elements
    - [ ] Debugging React Apps
    - [ ] Diving Deeper into Components & React Internals
    - [ ] A Real App_ The Burger Builder (Basic Version)
    - [ ] Reaching out to the Web (Http _ Ajax)
    - [ ] Burger Builder Project_ Accessing a Server
    - [ ] Multi-Page-Feeling in a Single-Page-App_ Routing
    - [ ] Adding Routing to our Burger Project
*** DONE Contribute and Learn [2/2]
    CLOSED: [2019-03-19 Tue 11:36]
    :PROPERTIES:
    :ESTIMATED: 15
    :ACTUAL:
    :OWNER: nightwarrior-xxx
    :ID: DEV.1552081276
    :TASKID: DEV.1552081276
    :END:
    :LOGBOOK:
    CLOCK: [2019-03-19 Tue 11:36]--[2019-03-19 Tue 11:36] =>  0:00
    CLOCK: [2019-03-17 Sun 16:48]--[2019-03-17 Sun 16:56] =>  0:08
    CLOCK: [2019-03-17 Sun 01:05]--[2019-03-17 Sun 02:10] =>  1:05
    CLOCK: [2019-03-14 Thu 12:15]--[2019-03-14 Thu 12:45] =>  0:30
    CLOCK: [2019-03-13 Wed 15:15]--[2019-03-13 Wed 16:01] =>  0:46
    CLOCK: [2019-03-11 Mon 02:30]--[2019-03-11 Mon 03:32] =>  1:02
    :END:
    - [X] Introduce modern JS features and tools to phpMyAdmin codebase
      - Webpack
    - [X] Ship completion files for shells
      - bash,zsh 
*** Innovate and Build [0/1]
    :PROPERTIES:
    :ESTIMATED: 6
    :ACTUAL:
    :OWNER: nightwarrior-xxx
    :ID: DEV.1552081239
    :TASKID: DEV.1552081239
    :END:
    - [ ] Password Manager in Lua programming lanaguage
*** IN_PROGRESS Learn concepts of Lua [0/2]
    :PROPERTIES:
    :ESTIMATED: 3
    :ACTUAL:
    :OWNER: nightwarrior-xxx
    :ID: READ.1552081129
    :TASKID: READ.1552081129
    :END:
    - [ ] treating the arguments
    - [ ] applying the trie algo on arguments
